Revit 2027 API
AnalysisDisplayDiagramSettings Constructor
Overload List
Name | Description
AnalysisDisplayDiagramSettings() |  Constructs a default instance of diagram settings.
AnalysisDisplayDiagramSettings(AnalysisDisplayDiagramSettings) |  Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Top
See Also
Reference
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace